app/Controllers/Admin/Dashboard.php

   public function index()
   {
      // Cek session
      if (!session()->get('isLoggedIn') || session()->get('level') !== 'admin') {
         return redirect()->to('/login');
      }

      $data = [
         'title' => 'Dashboard Admin',
         'total_users' => $this->userModel->countAll(),
         'total_pejabat' => $this->pejabatModel->countAll(),
         'users' => $this->userModel->findAll(),
---
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT *
FROM `users`