app/Controllers/Admin/UserController.php

   public function update($id)
   {
      $user = $this->userModel->find($id);

      $rules = [
         'username' => "required|is_unique[users.username,id,$id]|min_length[3]",
         'nama_lengkap' => 'required',
         'email' => "required|valid_email|is_unique[users.email,id,$id]",
         'level' => 'required|in_list[admin,sekretaris,kepala_desa]'
      ];

      if (!$this->validate($rules)) {
         return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
      }

      $data = [
         'id' => $id,
         'username' => $this->request->getPost('username'),
         'nama_lengkap' => $this->request->getPost('nama_lengkap'),
         'email' => $this->request->getPost('email'),
         'level' => $this->request->getPost('level'),
         'is_active' => $this->request->getPost('is_active') ? 1 : 0
      ];

      if ($this->request->getPost('password')) {
         $data['password'] = password_hash($this->request->getPost('password'), PASSWORD_DEFAULT);
      }

      $this->userModel->save($data);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '13'
UPDATE `users` SET `username` = 'sekre', `nama_lengkap` = 'Si paling sekretaris', `email` = 'sipalingsekre@gmail.com', `level` = 'sekretaris', `is_active` = 1, `updated_at` = '2025-05-05 01:48:41'
WHERE `users`.`id` IN ('13')