app/Controllers/Sekretaris/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `penduduk`
SELECT COUNT(*) AS `numrows`
FROM `kelahiran`
WHERE MONTH(kelahiran.tanggal_lahir) = '05'
AND YEAR(kelahiran.tanggal_lahir) = '2025'
SELECT COUNT(*) AS `numrows`
FROM `kematian`
WHERE MONTH(kematian.tanggal_meninggal) = '05'
AND YEAR(kematian.tanggal_meninggal) = '2025'
SELECT `surat_keterangan`.*, `jenis_surat`.`nama_surat`, `penduduk`.`nama_lengkap` as `nama_penduduk`
FROM `surat_keterangan`
JOIN `jenis_surat` ON `jenis_surat`.`id` = `surat_keterangan`.`jenis_surat_id`
JOIN `penduduk` ON `penduduk`.`id` = `surat_keterangan`.`penduduk_id`
ORDER BY `surat_keterangan`.`created_at` DESC
 LIMIT 5
---
   public function index()
   {
      $currentMonth = date('m');
      $currentYear = date('Y');

      $data = [
         'title' => 'Dashboard Sekretaris',
         'total_penduduk' => $this->pendudukModel->countAll(),
         'kelahiran_bulan_ini' => $this->kelahiranModel
            ->where('MONTH(kelahiran.tanggal_lahir)', $currentMonth)
            ->where('YEAR(kelahiran.tanggal_lahir)', $currentYear)
            ->countAllResults(),
         'kematian_bulan_ini' => $this->kematianModel
            ->where('MONTH(kematian.tanggal_meninggal)', $currentMonth)
            ->where('YEAR(kematian.tanggal_meninggal)', $currentYear)
            ->countAllResults(),
         'surat_pending' => $this->suratModel
            ->where('status', 'diajukan')
            ->countAllResults(),
         'surat_terbaru' => $this->suratModel
            ->select('surat_keterangan.*, jenis_surat.nama_surat, penduduk.nama_lengkap as nama_penduduk')
            ->join('jenis_surat', 'jenis_surat.id = surat_keterangan.jenis_surat_id')
            ->join('penduduk', 'penduduk.id = surat_keterangan.penduduk_id')
            ->orderBy('surat_keterangan.created_at', 'DESC')
            ->limit(5)
            ->findAll(),

SELECT `penduduk`.`nama_lengkap` as `nama`, `kelahiran`.`tanggal_lahir` as `tanggal`, "Kelahiran" as `jenis`
FROM `kelahiran`
JOIN `penduduk` ON `penduduk`.`id` = `kelahiran`.`penduduk_id`
ORDER BY `kelahiran`.`tanggal_lahir` DESC
 LIMIT 3
SELECT `penduduk`.`nama_lengkap` as `nama`, `kematian`.`tanggal_meninggal` as `tanggal`, "Kematian" as `jenis`
FROM `kematian`
JOIN `penduduk` ON `penduduk`.`id` = `kematian`.`penduduk_id`
ORDER BY `kematian`.`tanggal_meninggal` DESC
 LIMIT 3
SELECT CONCAT(p1.nama_lengkap, " & ", p2.nama_lengkap) as nama, `perkawinan`.`tanggal_perkawinan` as `tanggal`, "Perkawinan" as `jenis`
FROM `perkawinan`
JOIN `penduduk` `p1` ON `p1`.`id` = `perkawinan`.`suami_id`
JOIN `penduduk` `p2` ON `p2`.`id` = `perkawinan`.`istri_id`
ORDER BY `perkawinan`.`tanggal_perkawinan` DESC
 LIMIT 3
---
   private function getPeristiwaTerbaru()
   {
      $kelahiran = $this->kelahiranModel
         ->select('penduduk.nama_lengkap as nama, kelahiran.tanggal_lahir as tanggal, "Kelahiran" as jenis')
         ->join('penduduk', 'penduduk.id = kelahiran.penduduk_id')
         ->orderBy('kelahiran.tanggal_lahir', 'DESC')
         ->limit(3)
         ->findAll();

      $kematian = $this->kematianModel
         ->select('penduduk.nama_lengkap as nama, kematian.tanggal_meninggal as tanggal, "Kematian" as jenis')
         ->join('penduduk', 'penduduk.id = kematian.penduduk_id')
         ->orderBy('kematian.tanggal_meninggal', 'DESC')
         ->limit(3)
         ->findAll();

      $perkawinan = $this->perkawinanModel
         ->select('CONCAT(p1.nama_lengkap, " & ", p2.nama_lengkap) as nama, perkawinan.tanggal_perkawinan as tanggal, "Perkawinan" as jenis')
         ->join('penduduk p1', 'p1.id = perkawinan.suami_id')
         ->join('penduduk p2', 'p2.id = perkawinan.istri_id')
         ->orderBy('perkawinan.tanggal_perkawinan', 'DESC')
         ->limit(3)
         ->findAll();