app/Controllers/Sekretaris/Kematian.php

   public function update($id)
   {
      $kematian = $this->kematianModel->find($id);
---
SELECT *
FROM `kematian`
WHERE `kematian`.`id` = '1'

         'tempat_meninggal' => $this->request->getPost('tempat_meninggal')
      ];

      $this->kematianModel->save($data);
---
UPDATE `kematian` SET `penduduk_id` = '5', `tanggal_meninggal` = '2025-05-05', `penyebab` = 'Keracunan', `tempat_meninggal` = 'Puskesmas Konoha', `updated_at` = '2025-05-10 00:49:49'
WHERE `kematian`.`id` IN ('1')