app/Controllers/Sekretaris/Penduduk.php

SELECT *
FROM `penduduk`
---
   public function index()
   {
      $data = [
         'title' => 'Data Penduduk',
         'penduduk' => $this->pendudukModel->findAll()
      ];

INSERT INTO `penduduk` (`nik`, `nama_lengkap`, `tempat_lahir`, `tanggal_lahir`, `jenis_kelamin`, `agama`, `status_perkawinan`, `pekerjaan`, `penghasilan`, `alamat`, `rt`, `rw`, `dusun`, `status_hidup`, `created_at`, `updated_at`) VALUES ('1234567890123456', 'AHIAHAI', 'Mataram', '2000-05-07', 'L', 'Nyembah Beringin', 'kawin', 'PNS', '5000000', 'Jalan Tebu', '1', '1', 'Konoha', '1', '2025-05-07 14:38:55', '2025-05-07 14:38:55')
---
   public function simpan()
   {

      if (!$this->validate($this->pendudukModel->getValidationRules())) {
         return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
      }

      $data = [
         'nik' => $this->request->getPost('nik'),
         'nama_lengkap' => $this->request->getPost('nama_lengkap'),
         'tempat_lahir' => $this->request->getPost('tempat_lahir'),
         'tanggal_lahir' => $this->request->getPost('tanggal_lahir'),
         'jenis_kelamin' => $this->request->getPost('jenis_kelamin'),
         'agama' => $this->request->getPost('agama'),
         'pendidikan_terakhir' => $this->request->getPost('pendidikan_terakhir'),
         'status_perkawinan' => $this->request->getPost('status_perkawinan'),
         'pekerjaan' => $this->request->getPost('pekerjaan'),
         'penghasilan' => $this->request->getPost('penghasilan') ?? 0,
         'alamat' => $this->request->getPost('alamat'),
         'rt' => $this->request->getPost('rt'),
         'rw' => $this->request->getPost('rw'),
         'dusun' => $this->request->getPost('dusun'),
         'status_hidup' => $this->request->getPost('status_hidup') ?? 1
      ];

      $this->pendudukModel->save($data);

SELECT *
FROM `penduduk`
WHERE `penduduk`.`id` = '4'
---
   public function edit($id)
   {
      $data = [
         'title' => 'Edit Data Penduduk',
         'penduduk' => $this->pendudukModel->find($id),
         'validation' => \Config\Services::validation()
      ];