app/Controllers/Sekretaris/Perkawinan.php

   public function edit($id)
   {
      $perkawinan = $this->perkawinanModel->getPerkawinanWithDetail($id);

      if (!$perkawinan) {
         return redirect()->to('/sekretaris/perkawinan')
            ->with('error', 'Data perkawinan tidak ditemukan');
      }

      $data = [
         'title' => 'Edit Data Perkawinan',
         'perkawinan' => $perkawinan,
         'penduduk_laki' => $this->pendudukModel->where('jenis_kelamin', 'L')->findAll(),
         'penduduk_perempuan' => $this->pendudukModel->where('jenis_kelamin', 'P')->findAll(),
---
SELECT *
FROM `penduduk`
WHERE `jenis_kelamin` = 'L'
SELECT *
FROM `penduduk`
WHERE `jenis_kelamin` = 'P'