app/Controllers/Sekretaris/Surat.php

   public function index()
   {
      $data = [
         'title' => 'Surat Keterangan',
         'jenis_surat' => $this->jenisSuratModel->findAll(),
         'surat_list' => $this->suratModel
            ->select('surat_keterangan.*, jenis_surat.nama_surat, penduduk.nama_lengkap as nama_penduduk')
            ->join('jenis_surat', 'jenis_surat.id = surat_keterangan.jenis_surat_id')
            ->join('penduduk', 'penduduk.id = surat_keterangan.penduduk_id')
            ->where('sekretaris_id', session('id'))
            ->orderBy('tanggal_pengajuan', 'DESC')
            ->findAll()
---
SELECT *
FROM `jenis_surat`
SELECT `surat_keterangan`.*, `jenis_surat`.`nama_surat`, `penduduk`.`nama_lengkap` as `nama_penduduk`
FROM `surat_keterangan`
JOIN `jenis_surat` ON `jenis_surat`.`id` = `surat_keterangan`.`jenis_surat_id`
JOIN `penduduk` ON `penduduk`.`id` = `surat_keterangan`.`penduduk_id`
WHERE `sekretaris_id` = '2'
ORDER BY `tanggal_pengajuan` DESC

   public function jenis($kode)
   {
      $jenisSurat = $this->jenisSuratModel->where('kode_surat', $kode)->first();

      if (!$jenisSurat) {
         return redirect()->back()->with('error', 'Jenis surat tidak ditemukan');
      }

      $data = [
         'title' => 'Buat ' . $jenisSurat['nama_surat'],
         'jenis_surat' => $jenisSurat,
         'penduduk' => $this->pendudukModel->findAll()
      ];
---
SELECT *
FROM `jenis_surat`
WHERE `kode_surat` = 'SK-DOM'
 LIMIT 1

   public function buat()
   {
      $jenisKode = $this->request->getGet('jenis');
      $pendudukId = $this->request->getGet('penduduk_id');

      // Validasi
      if (empty($jenisKode) || empty($pendudukId)) {
         return redirect()->to('/sekretaris/surat')
            ->with('error', 'Parameter tidak lengkap');
      }

      // Ambil data penduduk sebagai array
      $penduduk = $this->pendudukModel->find($pendudukId);
      if (!$penduduk) {
         return redirect()->to('/sekretaris/surat')
            ->with('error', 'Data penduduk tidak ditemukan');
      }

      // Konversi ke array jika berupa object
      $pendudukArray = is_object($penduduk) ? $penduduk->toArray() : $penduduk;

      // Ambil data tambahan khusus kematian jika ada
      $dataKematian = [];
      $kematianData = $this->kematianModel->where('penduduk_id', $pendudukId)->first();
---
SELECT *
FROM `penduduk`
WHERE `penduduk`.`id` = '1'
SELECT *
FROM `kematian`
WHERE `penduduk_id` = '1'
 LIMIT 1

      $mergedData = array_merge($pendudukArray, $dataKematian);

      // Dapatkan template dan data yang dibutuhkan
      $jenisSurat = $this->jenisSuratModel->where('kode_surat', $jenisKode)->first();
---
SELECT *
FROM `jenis_surat`
WHERE `kode_surat` = 'SK-DOM'
 LIMIT 1

   public function pilihPenduduk()
   {
      $jenisKode = $this->request->getGet('jenis');
      $jenisSurat = $this->jenisSuratModel->where('kode_surat', $jenisKode)->first();

      if (!$jenisSurat) {
         return redirect()->to('/sekretaris/surat')->with('error', 'Jenis surat tidak valid');
      }

      // Query berbeda untuk SK-MATI
      if ($jenisKode == 'SK-MATI') {
         $penduduk = $this->pendudukModel
            ->select('penduduk.*, kematian.tanggal_meninggal')
            ->join('kematian', 'kematian.penduduk_id = penduduk.id')
            ->where('penduduk.status_hidup', 0) // Hanya yang statusnya meninggal
            ->findAll();
      } else {
         $penduduk = $this->pendudukModel->findAll();
---
SELECT *
FROM `jenis_surat`
WHERE `kode_surat` = 'SK-DOM'
 LIMIT 1
SELECT *
FROM `penduduk`