app/Controllers/Sekretaris/Surat.php

SELECT *
FROM `jenis_surat`
WHERE `kode_surat` = 'SK-DOM'
 LIMIT 1
SELECT *
FROM `penduduk`
---
   public function pilihPenduduk()
   {
      $jenisKode = $this->request->getGet('jenis');
      $jenisSurat = $this->jenisSuratModel->where('kode_surat', $jenisKode)->first();

      if (!$jenisSurat) {
         return redirect()->to('/sekretaris/surat')->with('error', 'Jenis surat tidak valid');
      }

      $data = [
         'title' => 'Pilih Penduduk untuk ' . $jenisSurat['nama_surat'],
         'jenis_surat' => $jenisSurat,
         'penduduk' => $this->pendudukModel->findAll()