app/Controllers/KepalaDesa/Dashboard.php

   public function index()
   {

      $data = [
         'title' => 'Dashboard Kepala Desa',
         'total_penduduk' => $this->pendudukModel->where('status_hidup', 1)->countAllResults(),
         'kelahiran_bulan_ini' => $this->kelahiranModel->where('MONTH(tanggal_lahir)', date('m'))
            ->where('YEAR(tanggal_lahir)', date('Y'))
            ->countAllResults(),
         'kematian_bulan_ini' => $this->kematianModel->where('MONTH(tanggal_meninggal)', date('m'))
            ->where('YEAR(tanggal_meninggal)', date('Y'))
            ->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `penduduk`
WHERE `status_hidup` = 1
SELECT COUNT(*) AS `numrows`
FROM `kelahiran`
WHERE MONTH(tanggal_lahir) = '05'
AND YEAR(tanggal_lahir) = '2025'
SELECT COUNT(*) AS `numrows`
FROM `kematian`
WHERE MONTH(tanggal_meninggal) = '05'
AND YEAR(tanggal_meninggal) = '2025'