app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'sekre'
 LIMIT 1
---
   public function attemptLogin()
   {
      // Validasi input
      if (!$this->validate([
         'username' => 'required',
         'password' => 'required'
      ])) {
         return redirect()->back()->withInput();
      }

      $username = $this->request->getVar('username');
      $password = $this->request->getVar('password');

      // Cari user berdasarkan username
      $user = $this->userModel->where('username', $username)->first();