app/Models/JenisSuratModel.php

   public function getTemplateByKode($kode)
   {
      $jenis = $this->where('kode_surat', $kode)->first();
---
SELECT *
FROM `jenis_surat`
WHERE `kode_surat` = 'SK-DOM'
 LIMIT 1