app/Models/KematianModel.php

   public function getKematianWithPenduduk()
   {
      return $this->select('kematian.*, penduduk.nik, penduduk.nama_lengkap, penduduk.tanggal_lahir')
         ->join('penduduk', 'penduduk.id = kematian.penduduk_id')
         ->orderBy('tanggal_meninggal', 'DESC')
         ->findAll();
---
SELECT `kematian`.*, `penduduk`.`nik`, `penduduk`.`nama_lengkap`, `penduduk`.`tanggal_lahir`
FROM `kematian`
JOIN `penduduk` ON `penduduk`.`id` = `kematian`.`penduduk_id`
ORDER BY `tanggal_meninggal` DESC

   public function updateStatusPenduduk($penduduk_id)
   {
      $pendudukModel = new \App\Models\PendudukModel();
      $perkawinanModel = new \App\Models\PerkawinanModel();

      // Cari data penduduk yang meninggal
      $penduduk = $pendudukModel->find($penduduk_id);

      // Cek apakah penduduk memiliki status perkawinan 'kawin'
      if ($penduduk['status_perkawinan'] === 'kawin') {
         // Cari data perkawinan aktif
         $perkawinan = $perkawinanModel->where('status', 'Kawin')
            ->groupStart()
            ->where('suami_id', $penduduk_id)
            ->orWhere('istri_id', $penduduk_id)
            ->groupEnd()
            ->first();

         if ($perkawinan) {
            // Update status perkawinan menjadi 'Meninggal'
            $perkawinanModel->update($perkawinan['id'], ['status' => 'Meninggal']);

            // Update status kedua pasangan
            $pendudukModel->update($perkawinan['suami_id'], ['status_perkawinan' => 'cerai_mati']);
            $pendudukModel->update($perkawinan['istri_id'], ['status_perkawinan' => 'cerai_mati']);
         }
      }

      // Update status hidup penduduk
      $pendudukModel->update($penduduk_id, ['status_hidup' => 0]);
---
SELECT *
FROM `penduduk`
WHERE `penduduk`.`id` = '5'
UPDATE `penduduk` SET `status_hidup` = 0, `updated_at` = '2025-05-10 00:49:49'
WHERE `penduduk`.`id` IN ('5')