app/Models/PendudukModel.php

   public function getStatistikJenisKelamin()
   {
      $total = $this->where('status_hidup', 1)->countAllResults();
      $laki = $this->where('status_hidup', 1)
         ->where('jenis_kelamin', 'L')
         ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `penduduk`
WHERE `status_hidup` = 1
SELECT COUNT(*) AS `numrows`
FROM `penduduk`
WHERE `status_hidup` = 1
AND `jenis_kelamin` = 'L'

   public function getStatistikUsiaProduktif()
   {
      $total = $this->where('status_hidup', 1)->countAllResults();

      if ($total == 0) {
         return [
            'produktif' => 0,
            'total' => 0,
            'persentase' => 0
         ];
      }

      $produktif = $this->where('status_hidup', 1)
         ->where("FLOOR(DATEDIFF(CURRENT_DATE, tanggal_lahir)/365) BETWEEN 17 AND 60")
         ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `penduduk`
WHERE `status_hidup` = 1
SELECT COUNT(*) AS `numrows`
FROM `penduduk`
WHERE `status_hidup` = 1
AND FLOOR(DATEDIFF(CURRENT_DATE, tanggal_lahir)/365) BETWEEN 17 AND 60