app/Models/PerkawinanModel.php

   public function getPerkawinanWithPasangan()
   {
      return $this->select('perkawinan.*,
            suami.nik as nik_suami, suami.nama_lengkap as nama_suami,
            istri.nik as nik_istri, istri.nama_lengkap as nama_istri')
         ->join('penduduk suami', 'suami.id = perkawinan.suami_id')
         ->join('penduduk istri', 'istri.id = perkawinan.istri_id')
         ->orderBy('tanggal_perkawinan', 'DESC')
         ->findAll();
---
SELECT `perkawinan`.*, `suami`.`nik` as `nik_suami`, `suami`.`nama_lengkap` as `nama_suami`, `istri`.`nik` as `nik_istri`, `istri`.`nama_lengkap` as `nama_istri`
FROM `perkawinan`
JOIN `penduduk` `suami` ON `suami`.`id` = `perkawinan`.`suami_id`
JOIN `penduduk` `istri` ON `istri`.`id` = `perkawinan`.`istri_id`
ORDER BY `tanggal_perkawinan` DESC

   public function getPasanganAktif()
   {
      return $this->select('perkawinan.id,
                        suami.nik as nik_suami, suami.nama_lengkap as nama_suami,
                        istri.nik as nik_istri, istri.nama_lengkap as nama_istri')
         ->join('penduduk suami', 'suami.id = perkawinan.suami_id')
         ->join('penduduk istri', 'istri.id = perkawinan.istri_id')
         ->where('perkawinan.status', 'Kawin')
         ->findAll();
---
SELECT `perkawinan`.`id`, `suami`.`nik` as `nik_suami`, `suami`.`nama_lengkap` as `nama_suami`, `istri`.`nik` as `nik_istri`, `istri`.`nama_lengkap` as `nama_istri`
FROM `perkawinan`
JOIN `penduduk` `suami` ON `suami`.`id` = `perkawinan`.`suami_id`
JOIN `penduduk` `istri` ON `istri`.`id` = `perkawinan`.`istri_id`
WHERE `perkawinan`.`status` = 'Kawin'