app/Models/PerkawinanModel.php

   public function getPerkawinanWithDetail($id)
   {
      return $this->select('perkawinan.*,
        suami.nik as nik_suami, suami.nama_lengkap as nama_suami, suami.jenis_kelamin as jk_suami,
        istri.nik as nik_istri, istri.nama_lengkap as nama_istri, istri.jenis_kelamin as jk_istri')
         ->join('penduduk suami', 'suami.id = perkawinan.suami_id')
         ->join('penduduk istri', 'istri.id = perkawinan.istri_id')
         ->where('perkawinan.id', $id)
         ->first();
---
SELECT `perkawinan`.*, `suami`.`nik` as `nik_suami`, `suami`.`nama_lengkap` as `nama_suami`, `suami`.`jenis_kelamin` as `jk_suami`, `istri`.`nik` as `nik_istri`, `istri`.`nama_lengkap` as `nama_istri`, `istri`.`jenis_kelamin` as `jk_istri`
FROM `perkawinan`
JOIN `penduduk` `suami` ON `suami`.`id` = `perkawinan`.`suami_id`
JOIN `penduduk` `istri` ON `istri`.`id` = `perkawinan`.`istri_id`
WHERE `perkawinan`.`id` = '5'
 LIMIT 1