app/Models/SuratKeteranganModel.php

SELECT `surat_keterangan`.*, `jenis_surat`.`nama_surat`, `penduduk`.`nama_lengkap` as `nama_penduduk`
FROM `surat_keterangan`
JOIN `jenis_surat` ON `jenis_surat`.`id` = `surat_keterangan`.`jenis_surat_id`
JOIN `penduduk` ON `penduduk`.`id` = `surat_keterangan`.`penduduk_id`
WHERE `surat_keterangan`.`status` = 'diajukan'
ORDER BY `surat_keterangan`.`tanggal_pengajuan` DESC
 LIMIT 5
---
   public function getSuratTerbaru($limit = 5)
   {
      return $this->select('surat_keterangan.*, jenis_surat.nama_surat, penduduk.nama_lengkap as nama_penduduk')
         ->join('jenis_surat', 'jenis_surat.id = surat_keterangan.jenis_surat_id')
         ->join('penduduk', 'penduduk.id = surat_keterangan.penduduk_id')
         ->where('surat_keterangan.status', 'diajukan')
         ->orderBy('surat_keterangan.tanggal_pengajuan', 'DESC')
         ->limit($limit)
         ->find();

SELECT `surat_keterangan`.*, `jenis_surat`.`nama_surat`, `penduduk`.`nama_lengkap` as `nama_penduduk`
FROM `surat_keterangan`
JOIN `jenis_surat` ON `jenis_surat`.`id` = `surat_keterangan`.`jenis_surat_id`
JOIN `penduduk` ON `penduduk`.`id` = `surat_keterangan`.`penduduk_id`
WHERE `surat_keterangan`.`status` = 'diajukan'
ORDER BY `surat_keterangan`.`tanggal_pengajuan` DESC
 LIMIT 10
---
   public function getSuratByStatus($status, $limit = null)
   {
      $builder = $this->select('surat_keterangan.*, jenis_surat.nama_surat, penduduk.nama_lengkap as nama_penduduk')
         ->join('jenis_surat', 'jenis_surat.id = surat_keterangan.jenis_surat_id')
         ->join('penduduk', 'penduduk.id = surat_keterangan.penduduk_id')
         ->where('surat_keterangan.status', $status)
         ->orderBy('surat_keterangan.tanggal_pengajuan', 'DESC');

      if ($limit) {
         $builder->limit($limit);
      }

      return $builder->findAll();